# Progetto di Foundations of Computer Science

## 1. For each university, extract from the times dataset the most recent and the least recent data, obtaining two separate dataframes

In [1]:
import pandas as pd
import re
import numpy as np

In [2]:
times = pd.read_csv("https://raw.githubusercontent.com/Vitorg-ux/Project2020/main/timesData.csv", engine='python', na_values = '-',thousands =',')
times.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,20152.0,8.9,25%,NaN,2011
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,2243.0,6.9,27%,33 : 67,2011
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,11074.0,9.0,33%,37 : 63,2011
3,4,Stanford University,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,15596.0,7.8,22%,42 : 58,2011
4,5,Princeton University,United States of America,90.9,70.3,95.4,99.9,NaN,94.2,7929.0,8.4,27%,45 : 55,2011

In [3]:
most_recent = times[times['year'] >= times['year'].max()].copy()
most_recent.tail()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
2598,601-800,Yeungnam University,South Korea,18.6,24.3,10.9,26.5,35.4,NaN,21958.0,15.3,3%,48 : 52,2016
2599,601-800,Yıldız Technical University,Turkey,14.5,14.9,7.6,19.3,44.0,NaN,31268.0,28.7,2%,36 : 64,2016
2600,601-800,Yokohama City University,Japan,24.0,16.1,10.2,36.4,37.9,NaN,4122.0,3.7,3%,NaN,2016
2601,601-800,Yokohama National University,Japan,20.1,23.3,16.0,13.5,40.4,NaN,10117.0,12.1,8%,28 : 72,2016
2602,601-800,Yuan Ze University,Taiwan,16.2,17.7,18.3,28.6,39.8,NaN,8663.0,20.6,4%,43 : 57,2016

In [4]:
least_recent = times[times['year'] <= times['year'].min()]
least_recent

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,Harvard University,United States of America,99.7,72.4,98.7,98.8,34.5,96.1,20152.0,8.9,25%,NaN,2011
1,2,California Institute of Technology,United States of America,97.7,54.6,98.0,99.9,83.7,96.0,2243.0,6.9,27%,33 : 67,2011
2,3,Massachusetts Institute of Technology,United States of America,97.8,82.3,91.4,99.9,87.5,95.6,11074.0,9.0,33%,37 : 63,2011
3,4,Stanford University,United States of America,98.3,29.5,98.1,99.2,64.3,94.3,15596.0,7.8,22%,42 : 58,2011
4,5,Princeton University,United States of America,90.9,70.3,95.4,99.9,NaN,94.2,7929.0,8.4,27%,45 : 55,2011
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
195,196,Kent State University,United States of America,33.5,15.9,33.3,76.8,26.3,46.5,23122.0,19.0,8%,58 : 42,2011
196,197,University of Illinois at Chicago,United States of America,57.8,51.8,46.8,34.7,NaN,46.4,24313.0,9.2,17%,53 : 47,2011
197,197,Zhejiang University,China,54.6,29.6,41.3,44.3,70.3,46.4,47508.0,15.9,5%,41 : 59,2011
198,199,Simon Fraser University,Canada,32.9,51.9,44.2,60.2,37.9,46.2,26640.0,28.3,19%,55 : 45,2011
199,199,Swedish University of Agricultural Sciences,Sweden,43.3,NaN,49.5,41.7,99.9,46.2,3879.0,4.6,NaN,67 : 33,2011

In [5]:
least_recent['year'].unique()

array([2011])

## 2. For each university, compute the improvement in income between the least recent and the most recent data points

In [6]:
uniti = pd.merge(most_recent, least_recent, on = 'university_name')
uniti.head()

,world_rank_x,university_name,country_x,teaching_x,international_x,research_x,citations_x,income_x,total_score_x,num_students_x,...,international_y,research_y,citations_y,income_y,total_score_y,num_students_y,student_staff_ratio_y,international_students_y,female_male_ratio_y,year_y
0,1,California Institute of Technology,United States of America,95.6,64.0,97.6,99.8,97.8,95.2,2243.0,...,54.6,98.0,99.9,83.7,96.0,2243.0,6.9,27%,33 : 67,2011
1,2,University of Oxford,United Kingdom,86.5,94.4,98.9,98.8,73.1,94.2,19919.0,...,77.2,93.9,95.1,73.5,91.2,19919.0,11.6,34%,46 : 54,2011
2,3,Stanford University,United States of America,92.5,76.3,96.2,99.9,63.3,93.9,15596.0,...,29.5,98.1,99.2,64.3,94.3,15596.0,7.8,22%,42 : 58,2011
3,4,University of Cambridge,United Kingdom,88.2,91.5,96.7,97.0,55.0,92.8,18812.0,...,77.7,94.1,94.0,57.0,91.2,18812.0,11.8,34%,46 : 54,2011
4,5,Massachusetts Institute of Technology,United States of America,89.4,84.0,88.6,99.7,95.4,92.0,11074.0,...,82.3,91.4,99.9,87.5,95.6,11074.0,9.0,33%,37 : 63,2011

In [7]:
uniti['improvement'] = pd.to_numeric(uniti['income_x']) - pd.to_numeric(uniti['income_y'])
uniti.head()

,world_rank_x,university_name,country_x,teaching_x,international_x,research_x,citations_x,income_x,total_score_x,num_students_x,...,research_y,citations_y,income_y,total_score_y,num_students_y,student_staff_ratio_y,international_students_y,female_male_ratio_y,year_y,improvement
0,1,California Institute of Technology,United States of America,95.6,64.0,97.6,99.8,97.8,95.2,2243.0,...,98.0,99.9,83.7,96.0,2243.0,6.9,27%,33 : 67,2011,14.1
1,2,University of Oxford,United Kingdom,86.5,94.4,98.9,98.8,73.1,94.2,19919.0,...,93.9,95.1,73.5,91.2,19919.0,11.6,34%,46 : 54,2011,-0.4
2,3,Stanford University,United States of America,92.5,76.3,96.2,99.9,63.3,93.9,15596.0,...,98.1,99.2,64.3,94.3,15596.0,7.8,22%,42 : 58,2011,-1.0
3,4,University of Cambridge,United Kingdom,88.2,91.5,96.7,97.0,55.0,92.8,18812.0,...,94.1,94.0,57.0,91.2,18812.0,11.8,34%,46 : 54,2011,-2.0
4,5,Massachusetts Institute of Technology,United States of America,89.4,84.0,88.6,99.7,95.4,92.0,11074.0,...,91.4,99.9,87.5,95.6,11074.0,9.0,33%,37 : 63,2011,7.9

## 3. Find the university with the largest increase computed in the previous point

In [8]:
uniti[uniti['improvement'] >= uniti['improvement'].max()][['university_name','improvement']]

                     university_name  improvement
52  Nanyang Technological University         59.9

## 4. For each ranking, consider only the most recent data point. For each university, compute the maximum difference between the rankings (e.g. for Aarhus University the value is 122-73=49). Notice that some rankings are expressed as a range

In [9]:
shanghai = pd.read_csv("https://raw.githubusercontent.com/Vitorg-ux/Project2020/main/shanghaiData.csv", engine='python', na_values = '-')
shanghai.tail()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
4892,401-500,University of Trieste,11-20,NaN,0.0,0.0,5.0,10.9,25.1,20.1,2015
4893,401-500,University of Zaragoza,9-13,NaN,0.0,0.0,7.6,5.1,33.3,13.1,2015
4894,401-500,Utah State University,126-146,NaN,13.6,0.0,3.6,10.8,25.1,15.5,2015
4895,401-500,Vienna University of Technology,4-6,NaN,0.0,0.0,0.0,12.2,28.8,22.9,2015
4896,401-500,Wake Forest University,126-146,NaN,0.0,0.0,14.9,7.5,25.0,11.9,2015

In [10]:
cwur = pd.read_csv("https://raw.githubusercontent.com/Vitorg-ux/Project2020/main/cwurData.csv" , na_values = '-')
cwur.tail()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
2195,996,University of the Algarve,Portugal,7,367,567,218,926,845,812,969.0,816,44.03,2015
2196,997,Alexandria University,Egypt,4,236,566,218,997,908,645,981.0,871,44.03,2015
2197,998,Federal University of Ceará,Brazil,18,367,549,218,830,823,812,975.0,824,44.03,2015
2198,999,University of A Coruña,Spain,40,367,567,218,886,974,812,975.0,651,44.02,2015
2199,1000,China Pharmaceutical University,China,83,367,567,218,861,991,812,981.0,547,44.02,2015

In [11]:
mr_shanghai = shanghai[shanghai['year'] >= shanghai['year'].max()].copy()
mr_shanghai.tail()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year
4892,401-500,University of Trieste,11-20,NaN,0.0,0.0,5.0,10.9,25.1,20.1,2015
4893,401-500,University of Zaragoza,9-13,NaN,0.0,0.0,7.6,5.1,33.3,13.1,2015
4894,401-500,Utah State University,126-146,NaN,13.6,0.0,3.6,10.8,25.1,15.5,2015
4895,401-500,Vienna University of Technology,4-6,NaN,0.0,0.0,0.0,12.2,28.8,22.9,2015
4896,401-500,Wake Forest University,126-146,NaN,0.0,0.0,14.9,7.5,25.0,11.9,2015

In [12]:
mr_cwur = cwur[cwur['year'] >= cwur['year'].max()].copy()
mr_cwur.tail()

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
2195,996,University of the Algarve,Portugal,7,367,567,218,926,845,812,969.0,816,44.03,2015
2196,997,Alexandria University,Egypt,4,236,566,218,997,908,645,981.0,871,44.03,2015
2197,998,Federal University of Ceará,Brazil,18,367,549,218,830,823,812,975.0,824,44.03,2015
2198,999,University of A Coruña,Spain,40,367,567,218,886,974,812,975.0,651,44.02,2015
2199,1000,China Pharmaceutical University,China,83,367,567,218,861,991,812,981.0,547,44.02,2015

In [13]:
#mr_shanghai2 =  shanghai[shanghai['year'] >= shanghai['year'].max()]

In [14]:
#mr_shanghai2[mr_shanghai2['world_rank'].str.contains('-')]['world_rank']

In [15]:
#mr_shanghai2[mr_shanghai2['world_rank'].str.contains('-')]['world_rank'].str.replace('(\d+)-(\d+)',r' \1', regex= True)

In [16]:
#mr_shanghai2.loc[mr_shanghai2['world_rank'].str.contains('-'), 'ranking'] = mr_shanghai2[mr_shanghai2['world_rank'].str.contains('-')]['world_rank'].str.replace('(\d+)-(\d+)',r' \1', regex= True)

In [17]:
extr = most_recent['world_rank'].str.extract(r'(\d+)(\-*)(\d*)')
most_recent['ranking'] = extr[0]
most_recent

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,ranking
1803,1,California Institute of Technology,United States of America,95.6,64.0,97.6,99.8,97.8,95.2,2243.0,6.9,27%,33 : 67,2016,1
1804,2,University of Oxford,United Kingdom,86.5,94.4,98.9,98.8,73.1,94.2,19919.0,11.6,34%,46 : 54,2016,2
1805,3,Stanford University,United States of America,92.5,76.3,96.2,99.9,63.3,93.9,15596.0,7.8,22%,42 : 58,2016,3
1806,4,University of Cambridge,United Kingdom,88.2,91.5,96.7,97.0,55.0,92.8,18812.0,11.8,34%,46 : 54,2016,4
1807,5,Massachusetts Institute of Technology,United States of America,89.4,84.0,88.6,99.7,95.4,92.0,11074.0,9.0,33%,37 : 63,2016,5
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2598,601-800,Yeungnam University,South Korea,18.6,24.3,10.9,26.5,35.4,NaN,21958.0,15.3,3%,48 : 52,2016,601
2599,601-800,Yıldız Technical University,Turkey,14.5,14.9,7.6,19.3,44.0,NaN,31268.0,28.7,2%,36 : 64,2016,601
2600,601-800,Yokohama City University,Japan,24.0,16.1,10.2,36.4,37.9,NaN,4122.0,3.7,3%,NaN,2016,601
2601,601-800,Yokohama National University,Japan,20.1,23.3,16.0,13.5,40.4,NaN,10117.0,12.1,8%,28 : 72,2016,601
2602,601-800,Yuan Ze University,Taiwan,16.2,17.7,18.3,28.6,39.8,NaN,8663.0,20.6,4%,43 : 57,2016,601

In [18]:
extr2 = mr_shanghai['world_rank'].str.extract(r'(\d+)(\-*)(\d*)')
mr_shanghai['ranking'] = extr2[0]
mr_shanghai

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,ranking
4397,1,Harvard University,1,100.0,100.0,100.0,100.0,100.0,100.0,76.6,2015,1
4398,2,Stanford University,2,73.3,40.7,89.6,80.1,70.1,70.6,53.8,2015,2
4399,3,Massachusetts Institute of Technology (MIT),3,70.4,68.2,80.7,60.6,73.1,61.1,68.0,2015,3
4400,4,"University of California, Berkeley",4,69.6,65.1,79.4,66.1,65.6,67.9,56.5,2015,4
4401,5,University of Cambridge,1,68.8,77.1,96.6,50.8,55.6,66.4,55.8,2015,5
...,...,...,...,...,...,...,...,...,...,...,...,...
4892,401-500,University of Trieste,11-20,NaN,0.0,0.0,5.0,10.9,25.1,20.1,2015,401
4893,401-500,University of Zaragoza,9-13,NaN,0.0,0.0,7.6,5.1,33.3,13.1,2015,401
4894,401-500,Utah State University,126-146,NaN,13.6,0.0,3.6,10.8,25.1,15.5,2015,401
4895,401-500,Vienna University of Technology,4-6,NaN,0.0,0.0,0.0,12.2,28.8,22.9,2015,401
4896,401-500,Wake Forest University,126-146,NaN,0.0,0.0,14.9,7.5,25.0,11.9,2015,401

In [19]:
rank = pd.merge(most_recent[['university_name','ranking']], mr_shanghai[['ranking','university_name']], on ='university_name', suffixes=('_times','_shanghai')  )   
rank = pd.merge(rank, mr_cwur[['world_rank','institution']], left_on ='university_name', right_on='institution', suffixes=('','_cwur')  ) 
rank.drop('institution',axis=1, inplace = True)
#rivedi

In [20]:
rank.rename(columns = {'world_rank' : 'ranking_cwur'}, inplace = True)

In [21]:
rank['max_diff'] = rank[['ranking_times','ranking_shanghai', 'ranking_cwur']].astype(int).max(axis=1) - rank[['ranking_times','ranking_shanghai', 'ranking_cwur']].astype(int).min(axis=1)
rank

,university_name,ranking_times,ranking_shanghai,ranking_cwur,max_diff
0,California Institute of Technology,1,7,12,11
1,University of Oxford,2,10,5,8
2,Stanford University,3,2,2,1
3,University of Cambridge,4,5,4,1
4,Harvard University,6,1,1,5
...,...,...,...,...,...
292,Okayama University,601,401,245,356
293,Polytechnic University of Valencia,601,301,440,300
294,Sichuan University,601,301,479,300
295,University of Szeged,601,401,731,330
296,University of Tehran,601,201,768,567

In [22]:
rank.max(axis = 1, numeric_only = True) -rank.min(axis = 1, numeric_only = True)

0        1
1        3
2        1
3        3
4        4
      ...
292    111
293    140
294    179
295    401
296    201
Length: 297, dtype: int64

In [23]:
rank[rank['university_name'] == 'Aarhus University']    #check come da traccia

      university_name ranking_times ranking_shanghai  ranking_cwur  max_diff
65  Aarhus University           106               73           122        49

## 5. Consider only the most recent data point of the times dataset. Compute the number of male and female students for each country.¶

In [24]:
mr_times = most_recent.dropna(subset= ['female_male_ratio', 'num_students']).copy()
mr_times.tail()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,ranking
2597,601-800,Xidian University,China,17.9,12.8,12.1,8.9,83.7,NaN,31618.0,16.4,2%,29 : 71,2016,601
2598,601-800,Yeungnam University,South Korea,18.6,24.3,10.9,26.5,35.4,NaN,21958.0,15.3,3%,48 : 52,2016,601
2599,601-800,Yıldız Technical University,Turkey,14.5,14.9,7.6,19.3,44.0,NaN,31268.0,28.7,2%,36 : 64,2016,601
2601,601-800,Yokohama National University,Japan,20.1,23.3,16.0,13.5,40.4,NaN,10117.0,12.1,8%,28 : 72,2016,601
2602,601-800,Yuan Ze University,Taiwan,16.2,17.7,18.3,28.6,39.8,NaN,8663.0,20.6,4%,43 : 57,2016,601

In [25]:
appoggio = mr_times['female_male_ratio'].str.extract(r'(\d+) : (\d+)')
mr_times['females'] = mr_times['num_students']*appoggio[0].astype(int)//(appoggio[0].astype(int)+appoggio[1].astype(int))
mr_times.head()          #se puoi ottimizza!!!

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,ranking,females
1803,1,California Institute of Technology,United States of America,95.6,64.0,97.6,99.8,97.8,95.2,2243.0,6.9,27%,33 : 67,2016,1,740.0
1804,2,University of Oxford,United Kingdom,86.5,94.4,98.9,98.8,73.1,94.2,19919.0,11.6,34%,46 : 54,2016,2,9162.0
1805,3,Stanford University,United States of America,92.5,76.3,96.2,99.9,63.3,93.9,15596.0,7.8,22%,42 : 58,2016,3,6550.0
1806,4,University of Cambridge,United Kingdom,88.2,91.5,96.7,97.0,55.0,92.8,18812.0,11.8,34%,46 : 54,2016,4,8653.0
1807,5,Massachusetts Institute of Technology,United States of America,89.4,84.0,88.6,99.7,95.4,92.0,11074.0,9.0,33%,37 : 63,2016,5,4097.0

In [26]:
mr_times['males'] = mr_times['num_students']*appoggio[1].astype(int)//(appoggio[1].astype(int)+appoggio[0].astype(int))
mr_times

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,ranking,females,males
1803,1,California Institute of Technology,United States of America,95.6,64.0,97.6,99.8,97.8,95.2,2243.0,6.9,27%,33 : 67,2016,1,740.0,1502.0
1804,2,University of Oxford,United Kingdom,86.5,94.4,98.9,98.8,73.1,94.2,19919.0,11.6,34%,46 : 54,2016,2,9162.0,10756.0
1805,3,Stanford University,United States of America,92.5,76.3,96.2,99.9,63.3,93.9,15596.0,7.8,22%,42 : 58,2016,3,6550.0,9045.0
1806,4,University of Cambridge,United Kingdom,88.2,91.5,96.7,97.0,55.0,92.8,18812.0,11.8,34%,46 : 54,2016,4,8653.0,10158.0
1807,5,Massachusetts Institute of Technology,United States of America,89.4,84.0,88.6,99.7,95.4,92.0,11074.0,9.0,33%,37 : 63,2016,5,4097.0,6976.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2597,601-800,Xidian University,China,17.9,12.8,12.1,8.9,83.7,NaN,31618.0,16.4,2%,29 : 71,2016,601,9169.0,22448.0
2598,601-800,Yeungnam University,South Korea,18.6,24.3,10.9,26.5,35.4,NaN,21958.0,15.3,3%,48 : 52,2016,601,10539.0,11418.0
2599,601-800,Yıldız Technical University,Turkey,14.5,14.9,7.6,19.3,44.0,NaN,31268.0,28.7,2%,36 : 64,2016,601,11256.0,20011.0
2601,601-800,Yokohama National University,Japan,20.1,23.3,16.0,13.5,40.4,NaN,10117.0,12.1,8%,28 : 72,2016,601,2832.0,7284.0
2602,601-800,Yuan Ze University,Taiwan,16.2,17.7,18.3,28.6,39.8,NaN,8663.0,20.6,4%,43 : 57,2016,601,3725.0,4937.0

In [27]:
mr_times.groupby('country')[['country', 'females', 'males']].sum()

                            females      males
country
Argentina                   67191.0    41181.0
Australia                  391722.0   321624.0
Austria                     68362.0    66109.0
Bangladesh                  21323.0    41392.0
Belarus                     20219.0     9083.0
...                             ...        ...
Uganda                      18670.0    18670.0
Ukraine                     17845.0    19249.0
United Arab Emirates         9515.0     4930.0
United Kingdom             711775.0   612993.0
United States of America  1597354.0  1553207.0

[70 rows x 2 columns]

## 6. Find the universities where the ratio between female and male is below the average ratio (computed over all universities)

In [28]:
mr_times['ratio'] = mr_times['females']/mr_times['males']
mr_times.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,ranking,females,males,ratio
1803,1,California Institute of Technology,United States of America,95.6,64.0,97.6,99.8,97.8,95.2,2243.0,6.9,27%,33 : 67,2016,1,740.0,1502.0,0.492676
1804,2,University of Oxford,United Kingdom,86.5,94.4,98.9,98.8,73.1,94.2,19919.0,11.6,34%,46 : 54,2016,2,9162.0,10756.0,0.851804
1805,3,Stanford University,United States of America,92.5,76.3,96.2,99.9,63.3,93.9,15596.0,7.8,22%,42 : 58,2016,3,6550.0,9045.0,0.724157
1806,4,University of Cambridge,United Kingdom,88.2,91.5,96.7,97.0,55.0,92.8,18812.0,11.8,34%,46 : 54,2016,4,8653.0,10158.0,0.851841
1807,5,Massachusetts Institute of Technology,United States of America,89.4,84.0,88.6,99.7,95.4,92.0,11074.0,9.0,33%,37 : 63,2016,5,4097.0,6976.0,0.587299

In [29]:
mr_times[mr_times['males']!= 0]['ratio'].mean()

1.0825891190672141

Cosa vuol dire il punto 6?!?!? in che senso tutte le università?

In [30]:
punto5 = mr_times[mr_times['ratio']< mr_times[mr_times['males']!= 0]['ratio'].mean()]
punto5.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,ranking,females,males,ratio
1803,1,California Institute of Technology,United States of America,95.6,64.0,97.6,99.8,97.8,95.2,2243.0,6.9,27%,33 : 67,2016,1,740.0,1502.0,0.492676
1804,2,University of Oxford,United Kingdom,86.5,94.4,98.9,98.8,73.1,94.2,19919.0,11.6,34%,46 : 54,2016,2,9162.0,10756.0,0.851804
1805,3,Stanford University,United States of America,92.5,76.3,96.2,99.9,63.3,93.9,15596.0,7.8,22%,42 : 58,2016,3,6550.0,9045.0,0.724157
1806,4,University of Cambridge,United Kingdom,88.2,91.5,96.7,97.0,55.0,92.8,18812.0,11.8,34%,46 : 54,2016,4,8653.0,10158.0,0.851841
1807,5,Massachusetts Institute of Technology,United States of America,89.4,84.0,88.6,99.7,95.4,92.0,11074.0,9.0,33%,37 : 63,2016,5,4097.0,6976.0,0.587299

In [31]:
punto5.sort_values(by=['ratio']).tail()      #giusto per essere sicuri sicuri

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,ranking,females,males,ratio
2190,351-400,Sun Yat-sen University,China,31.9,37.0,24.6,45.7,79.4,NaN,51351.0,16.6,8%,51 : 49,2016,351,26189.0,25161.0,1.040857
2215,401-500,University of Canterbury,New Zealand,23.5,91.0,22.5,38.9,52.1,NaN,12187.0,16.5,20%,51 : 49,2016,401,6215.0,5971.0,1.040864
1852,50,University of Wisconsin-Madison,United States of America,65.1,33.0,68.2,86.6,48.5,69.7,39655.0,10.8,11%,51 : 49,2016,50,20224.0,19430.0,1.040865
1969,=167,"University of California, Riverside",United States of America,27.5,59.5,33.3,91.2,42.5,51.1,20626.0,22.0,12%,51 : 49,2016,167,10519.0,10106.0,1.040867
2052,201-250,Wake Forest University,United States of America,34.6,24.2,19.5,94.8,42.5,NaN,7326.0,4.6,5%,51 : 49,2016,201,3736.0,3589.0,1.040958

## 7. For each country, compute the fraction of the students in the country that are in one of the universities computed in the previous point (that is, the denominator of the ratio is the total number of students over all universities in the country).

In [32]:
denominatore= mr_times.groupby('country')['num_students'].sum()
denominatore

country
Argentina                    108373.0
Australia                    713376.0
Austria                      134477.0
Bangladesh                    62716.0
Belarus                       29303.0
                              ...
Uganda                        37340.0
Ukraine                       37096.0
United Arab Emirates          14447.0
United Kingdom              1324842.0
United States of America    3150689.0
Name: num_students, Length: 70, dtype: float64

In [33]:
punto7 = pd.merge(punto5, denominatore, on = 'country')
punto7.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students_x,student_staff_ratio,international_students,female_male_ratio,year,ranking,females,males,ratio,num_students_y
0,1,California Institute of Technology,United States of America,95.6,64.0,97.6,99.8,97.8,95.2,2243.0,6.9,27%,33 : 67,2016,1,740.0,1502.0,0.492676,3150689.0
1,3,Stanford University,United States of America,92.5,76.3,96.2,99.9,63.3,93.9,15596.0,7.8,22%,42 : 58,2016,3,6550.0,9045.0,0.724157,3150689.0
2,5,Massachusetts Institute of Technology,United States of America,89.4,84.0,88.6,99.7,95.4,92.0,11074.0,9.0,33%,37 : 63,2016,5,4097.0,6976.0,0.587299,3150689.0
3,7,Princeton University,United States of America,85.1,78.5,91.9,99.3,52.1,90.1,7929.0,8.4,27%,45 : 55,2016,7,3568.0,4360.0,0.818349,3150689.0
4,10,University of Chicago,United States of America,85.7,65.0,88.9,99.2,36.6,87.9,14221.0,6.9,21%,42 : 58,2016,10,5972.0,8248.0,0.724054,3150689.0

In [34]:
punto7['fraction'] = punto7['num_students_x']/punto7['num_students_y']
punto7.head()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students_x,student_staff_ratio,international_students,female_male_ratio,year,ranking,females,males,ratio,num_students_y,fraction
0,1,California Institute of Technology,United States of America,95.6,64.0,97.6,99.8,97.8,95.2,2243.0,6.9,27%,33 : 67,2016,1,740.0,1502.0,0.492676,3150689.0,0.000712
1,3,Stanford University,United States of America,92.5,76.3,96.2,99.9,63.3,93.9,15596.0,7.8,22%,42 : 58,2016,3,6550.0,9045.0,0.724157,3150689.0,0.004950
2,5,Massachusetts Institute of Technology,United States of America,89.4,84.0,88.6,99.7,95.4,92.0,11074.0,9.0,33%,37 : 63,2016,5,4097.0,6976.0,0.587299,3150689.0,0.003515
3,7,Princeton University,United States of America,85.1,78.5,91.9,99.3,52.1,90.1,7929.0,8.4,27%,45 : 55,2016,7,3568.0,4360.0,0.818349,3150689.0,0.002517
4,10,University of Chicago,United States of America,85.7,65.0,88.9,99.2,36.6,87.9,14221.0,6.9,21%,42 : 58,2016,10,5972.0,8248.0,0.724054,3150689.0,0.004514

## 8. Read the file educational_attainment_supplementary_data.csv, discarding any row with missing country_name or series_name

In [35]:
educated_asd2 = pd.read_csv("https://raw.githubusercontent.com/Vitorg-ux/Project2020/main/educational_attainment_supplementary_data.csv")
educated_asd2.head()

,country_name,series_name,1985,1986,1987,1990,1991,1992,1993,1995,...,2005,2006,2007,2008,2009,2010,2011,2012,2013,2015
0,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.33,NaN,NaN,0.44,NaN,NaN,NaN,0.57,...,0.86,NaN,NaN,NaN,NaN,1.27,NaN,NaN,NaN,NaN
1,Afghanistan,"Barro-Lee: Average years of primary schooling,...",1.03,NaN,NaN,1.26,NaN,NaN,NaN,1.54,...,2.18,NaN,NaN,NaN,NaN,2.64,NaN,NaN,NaN,NaN
2,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.83,NaN,NaN,0.95,NaN,NaN,NaN,1.26,...,1.01,NaN,NaN,NaN,NaN,2.45,NaN,NaN,NaN,NaN
3,Afghanistan,"Barro-Lee: Average years of primary schooling,...",2.34,NaN,NaN,2.22,NaN,NaN,NaN,2.37,...,2.26,NaN,NaN,NaN,NaN,3.55,NaN,NaN,NaN,NaN
4,Afghanistan,"Barro-Lee: Average years of primary schooling,...",0.54,NaN,NaN,0.92,NaN,NaN,NaN,0.94,...,2.00,NaN,NaN,NaN,NaN,1.29,NaN,NaN,NaN,NaN

In [36]:
attainment = educated_asd2.dropna(subset= ['country_name', 'series_name'])
attainment[attainment['country_name'].isnull()]

Empty DataFrame
Columns: [country_name, series_name, 1985, 1986, 1987, 1990, 1991, 1992, 1993, 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009, 2010, 2011, 2012, 2013, 2015]
Index: []

[0 rows x 29 columns]

## 9. From attainment build a dataframe with the same data, but with 4 columns: country_name, series_name, year, value

In [37]:
educated_asd = pd.melt(attainment, id_vars=['country_name', 'series_name'], var_name ='year')
educated_asd.head()

  country_name                                        series_name  year  value
0  Afghanistan  Barro-Lee: Average years of primary schooling,...  1985   0.33
1  Afghanistan  Barro-Lee: Average years of primary schooling,...  1985   1.03
2  Afghanistan  Barro-Lee: Average years of primary schooling,...  1985   0.83
3  Afghanistan  Barro-Lee: Average years of primary schooling,...  1985   2.34
4  Afghanistan  Barro-Lee: Average years of primary schooling,...  1985   0.54

## 10. For each university, find the number of rankings in which they appear (it suffices to appear in one year for each ranking).

In [38]:
uni_times = pd.Series(times['university_name'].unique())

In [39]:
uni_shanghai = pd.Series(shanghai['university_name'].unique())

In [40]:
uni_cwur = pd.Series(cwur['institution'].unique())

In [41]:
uni = pd.concat([uni_times,uni_shanghai,uni_cwur]) 
uni

0                          Harvard University
1          California Institute of Technology
2       Massachusetts Institute of Technology
3                         Stanford University
4                        Princeton University
                        ...
1019                      Shenzhen University
1020               Tianjin Medical University
1021                  Babeș-Bolyai University
1022                  Henan Normal University
1023            Southwest Jiaotong University
Length: 2501, dtype: object

In [42]:
uni.value_counts()

Kyung Hee University                               3
Zhejiang University                                3
University of Belgrade                             3
Northeastern University                            3
King Saud University                               3
                                                  ..
University of Texas Medical Branch at Galveston    1
University of the Algarve                          1
University of St Gallen                            1
University of Paris Dauphine (Paris 9)             1
University of Extremadura                          1
Length: 1452, dtype: int64

## 11. In the times ranking, compute the number of times each university appears

In [43]:
#times[times['world_rank'].isnull()]

Empty DataFrame
Columns: [world_rank, university_name, country, teaching, international, research, citations, income, total_score, num_students, student_staff_ratio, international_students, female_male_ratio, year]
Index: []

In [58]:
#times.groupby('university_name', as_index = False).count()[['university_name','world_rank']]

In [70]:
times.groupby('university_name', as_index = False).size()

                              university_name  size
0    AGH University of Science and Technology     1
1                          Aalborg University     5
2                            Aalto University     5
3                           Aarhus University     6
4                      Aberystwyth University     5
..                                        ...   ...
813                  École Normale Supérieure     6
814          École Normale Supérieure de Lyon     6
815                       École Polytechnique     6
816  École Polytechnique Fédérale de Lausanne     6
817                         Örebro University     1

[818 rows x 2 columns]

In [84]:
u_times = times.groupby('university_name', as_index = False).size()

In [63]:
#u_times = times.groupby('university_name', as_index = False).count()[['university_name','world_rank']]

In [64]:
#u_times.rename(columns  = { 'world_rank': 'count'}, inplace = True)
#u_times.head()

## 12. Find the universities that appear at most twice in the times ranking

In [77]:
#u_times[u_times['count'] <= 2]

In [85]:
u_times[u_times['size'] <= 2 ]

                              university_name  size
0    AGH University of Science and Technology     1
5                  Adam Mickiewicz University     1
6                    Aix-Marseille University     1
7                             Ajou University     1
9              Alexandru Ioan Cuza University     1
..                                        ...   ...
806                  Yokohama City University     1
807              Yokohama National University     1
810                        Yuan Ze University     2
811               Yıldız Technical University     1
817                         Örebro University     1

[408 rows x 2 columns]

# 13. The universities that, in any year, have the same position in all three rankings (they must have the same position in a year).

In [48]:
times['world_rank'].unique()

array(['1', '2', '3', '4', '5', '6', '8', '9', '10', '11', '12', '13',
       '14', '15', '17', '18', '19', '20', '21', '22', '23', '24', '25',
       '26', '27', '28', '29', '30', '32', '33', '34', '35', '36', '37',
       '38', '39', '40', '41', '42', '43', '47', '48', '49', '51', '52',
       '53', '54', '55', '56', '57', '58', '59', '60', '61', '63', '64',
       '65', '66', '67', '68', '71', '72', '73', '75', '76', '77', '78',
       '79', '81', '83', '85', '86', '87', '88', '89', '90', '93', '94',
       '95', '98', '99', '100', '101', '102', '103', '104', '105', '106',
       '107', '109', '111', '112', '114', '115', '117', '118', '119',
       '120', '122', '124', '127', '128', '129', '130', '132', '135',
       '136', '137', '138', '139', '140', '142', '143', '144', '145',
       '147', '149', '151', '152', '155', '156', '158', '159', '161',
       '163', '164', '165', '167', '168', '170', '171', '172', '173',
       '174', '177', '178', '181', '182', '183', '184', '185', '186',
       '187', '189', '190', '193', '195', '196', '197', '199', '7', '16',
       '31', '44', '45', '46', '62', '69', '70', '74', '80', '84', '91',
       '92', '96', '97', '108', '110', '113', '116', '121', '123', '125',
       '131', '133', '134', '141', '146', '148', '150', '154', '157',
       '162', '166', '169', '176', '180', '191', '192', '194', '200',
       '201-225', '226-250', '251-275', '276-300', '301-350', '350-400',
       '50', '82', '153', '198', '351-400', '126', '160', '188', '175',
       '=39', '=44', '=47', '=56', '=60', '=65', '=76', '=82', '=88',
       '=90', '=94', '=99', '=101', '=104', '=106', '=110', '=113',
       '=120', '=123', '=125', '=127', '=131', '=133', '=138', '=144',
       '=149', '=158', '=161', '=164', '=167', '=172', '=176', '179',
       '=180', '=182', '=185', '=190', '=193', '=196', '201-250',
       '251-300', '401-500', '501-600', '601-800'], dtype=object)

In [49]:
#times[((times['world_rank']== '66') | (times['world_rank']== '=66')) & (times['year'] == 2016)]

In [88]:
cwur[(cwur['world_rank']>600)& (cwur['world_rank']<801)]['ranking'] = 601
cwur.tail()

<ipython-input-88-568dba22fe77>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  cwur[(cwur['world_rank']>600)& (cwur['world_rank']<801)]['ranking'] = 601

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
2195,996,University of the Algarve,Portugal,7,367,567,218,926,845,812,969.0,816,44.03,2015
2196,997,Alexandria University,Egypt,4,236,566,218,997,908,645,981.0,871,44.03,2015
2197,998,Federal University of Ceará,Brazil,18,367,549,218,830,823,812,975.0,824,44.03,2015
2198,999,University of A Coruña,Spain,40,367,567,218,886,974,812,975.0,651,44.02,2015
2199,1000,China Pharmaceutical University,China,83,367,567,218,861,991,812,981.0,547,44.02,2015

In [52]:
extr_times = times['world_rank'].str.extract(r'(\d+)(\-*)(\d*)')
times['ranking'] = extr_times[0]
times.tail()

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year,ranking
2598,601-800,Yeungnam University,South Korea,18.6,24.3,10.9,26.5,35.4,NaN,21958.0,15.3,3%,48 : 52,2016,601
2599,601-800,Yıldız Technical University,Turkey,14.5,14.9,7.6,19.3,44.0,NaN,31268.0,28.7,2%,36 : 64,2016,601
2600,601-800,Yokohama City University,Japan,24.0,16.1,10.2,36.4,37.9,NaN,4122.0,3.7,3%,NaN,2016,601
2601,601-800,Yokohama National University,Japan,20.1,23.3,16.0,13.5,40.4,NaN,10117.0,12.1,8%,28 : 72,2016,601
2602,601-800,Yuan Ze University,Taiwan,16.2,17.7,18.3,28.6,39.8,NaN,8663.0,20.6,4%,43 : 57,2016,601

In [53]:
extr_shanghai = shanghai['world_rank'].str.extract(r'(\d+)(\-*)(\d*)')
shanghai['ranking'] = extr_shanghai[0]
shanghai.tail()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,ranking
4892,401-500,University of Trieste,11-20,NaN,0.0,0.0,5.0,10.9,25.1,20.1,2015,401
4893,401-500,University of Zaragoza,9-13,NaN,0.0,0.0,7.6,5.1,33.3,13.1,2015,401
4894,401-500,Utah State University,126-146,NaN,13.6,0.0,3.6,10.8,25.1,15.5,2015,401
4895,401-500,Vienna University of Technology,4-6,NaN,0.0,0.0,0.0,12.2,28.8,22.9,2015,401
4896,401-500,Wake Forest University,126-146,NaN,0.0,0.0,14.9,7.5,25.0,11.9,2015,401

In [54]:
shanghai.tail()

,world_rank,university_name,national_rank,total_score,alumni,award,hici,ns,pub,pcp,year,ranking
4892,401-500,University of Trieste,11-20,NaN,0.0,0.0,5.0,10.9,25.1,20.1,2015,401
4893,401-500,University of Zaragoza,9-13,NaN,0.0,0.0,7.6,5.1,33.3,13.1,2015,401
4894,401-500,Utah State University,126-146,NaN,13.6,0.0,3.6,10.8,25.1,15.5,2015,401
4895,401-500,Vienna University of Technology,4-6,NaN,0.0,0.0,0.0,12.2,28.8,22.9,2015,401
4896,401-500,Wake Forest University,126-146,NaN,0.0,0.0,14.9,7.5,25.0,11.9,2015,401